# Reset Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireframeBuilder..::..Reset Method
WireframeBuilder Class See Also
---
Clears the accumulated geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void Reset()
```

Visual Basic
---
```text
Public Sub Reset
```

Visual C++
---
```text
public:
void Reset()
```

# See Also
WireframeBuilder Class
Autodesk.Revit.DB Namespace